docs/xStackQLResources.md
```mermaid
classDiagram
    class XStackQLResources{
        <<XStackQLResources>>
        resources Dictionary(String, Resource)
    }
    class Resource {
        <<Resource>>
        id String
        name String
        title String
        methods Dictionary(String, Method)
        sqlVerbs Dictionary(String, Array(SqlVerb))
    }
    class Method {
        <<Method>>
        operation Ref
        response Response
    }
    class Ref {
        <<Ref>>
        $ref String
    }
    class Response {
        <<Response>>
        mediaType String
        openAPIDocKey String
        objectKey String
    }
    class SqlVerb{
        <<SqlVerb>>
        operation Ref
    }
    XStackQLResources "1" -- "*" Resource : resources
    Resource "1" -- "*" Method : methods
    Resource "1" -- "*" SqlVerb : sqlVerbs
    Method "1" -- "1" Ref : operation
    Method "1" -- "1" Response : response
    SqlVerb "1" -- "1" Ref : operation
```
